c5/src/DataProcessors/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Items</name>
  <tabularSections>
    <name>Allocation</name>
    <attributes>
      <name>Allocated</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.InternalOrder</types>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Balances</name>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>PackagePresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reserve</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Selected</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>WarehousePresentation</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ChangeReservation</name>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.InternalOrder</types>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reserved</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ReservedPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Prices</name>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Provision</name>
    <attributes>
      <name>Allocated</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Reservation</name>
    <attributes>
      <name>Package</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reserved</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SelectedItems</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>ExtraCharge</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SelectedServices</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

c5/src/DataProcessors/Items/Forms/Common/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	setCurrentItem ();
	Options.SetAccuracy ( ThisObject, "Quantity, QuantityPkg, QuantityAvailable", false );
	Options.Company ( ThisObject, Company );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Package QuantityPkg show not Service;
	|Description show Service;
	|DiscountRate Discount show Discounts and ShowPrice;
	|DeliveryDate show Delivery;
	|Price Amount Prices show ShowPrice;
	|VATCode VAT show ( ShowPrice and VATUse > 0 );
	|Total show ( ShowPrice and VATUse = 2 );
	|Series show SeriesControl;
	|ProducerPrice show
	|( ShowPrice
	|	and Social
	|	and ShowSocial );
	|ExtraCharge show
	|( ShowPrice
	|	and Social
	|	and ShowExtraCharge );
	|Warning show Leaving and ( ( QuantityAvailable < Quantity and not CountPackages )
	|	or ( QuantityAvailable < QuantityPkg and CountPackages ) )
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure loadParams ()
	
	TableRow = Parameters.TableRow;
	FillPropertyValues ( ThisObject, TableRow );
	Source = Parameters.Source;
	QuantityAvailable = Parameters.QuantityAvailable;
	CountPackages = Parameters.CountPackages;
	Discounts = Parameters.Discounts;
	Delivery = Parameters.Delivery;
	Service = Parameters.Service;
	Organization = Parameters.Organization;
	Contract = Parameters.Contract;
	VendorContract = Parameters.VendorContract;
	Product = TableRow.Item;
	Company = Source.Company;
	ShowPrice = Source.ShowPrice;
	if ( ShowPrice ) then
		Prices = Source.Prices;
	endif;
	VATUse = Source.VATUse;
	type = Source.Type;
	if not ( type.Assembling
		or type.Disassembling
		or type.Production
		or type.TimeEntry ) then
		VATCode = TableRow.VATCode;
		VATRate = TableRow.VATRate;
		VAT = TableRow.VAT;
		Total = TableRow.Total;
	endif;
	Leaving = type.Sale
		or type.Invoice
		or type.Assembling
		or type.Disassembling;
	ShowExtraCharge = Parameters.ShowExtraCharge;
	ShowSocial = Parameters.ShowSocial;
	SeriesControl = Parameters.SeriesControl;
	
EndProcedure

&AtServer
Procedure setCurrentItem ()
	
	if ( Service
		or not Options.Packages () ) then
		CurrentItem = Items.Quantity;
	else
		CurrentItem = Items.QuantityPkg;
	endif; 
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	NotifyChoice ( getData () );
	
EndProcedure

&AtClient
Function getData ()
	
	FillPropertyValues ( TableRow, ThisObject );
	rows = new Array ();
	rows.Add ( TableRow );
	return rows;
	
EndFunction

&AtClient
Procedure QuantityPkgOnChange ( Item )
	
	Computations.Units ( ThisObject );
	Computations.Amount ( ThisObject );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );
	updateWarning ();
	
EndProcedure

&AtClient
Procedure updateWarning ()
	
	Appearance.Apply ( ThisObject, "Quantity" );

EndProcedure

&AtClient
Procedure PackageOnChange ( Item )
	
	applyPackage ();
	
EndProcedure

&AtClient
Procedure applyPackage ()
	
	p = new Structure ();
	p.Insert ( "Date", Source.Date );
	p.Insert ( "Organization", Organization );
	p.Insert ( "Contract", Contract );
	p.Insert ( "VendorContract", VendorContract );
	p.Insert ( "Warehouse", Source.Warehouse );
	p.Insert ( "Currency", Source.Currency );
	p.Insert ( "Item", Product );
	p.Insert ( "Feature", Feature );
	p.Insert ( "Package", Package );
	p.Insert ( "Prices", ? ( Prices.IsEmpty (), Source.Prices, Prices ) );
	p.Insert ( "Social", Social );
	data = getPackageData ( p );
	Capacity = data.Capacity;
	Price = data.Price;
	ProducerPrice = data.ProducerPrice;
	Computations.Units ( ThisObject );
	Computations.Amount ( ThisObject );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );
	updateWarning ();
	
EndProcedure 

&AtServerNoContext
Function getPackageData ( val Params )
	
	package = Params.Package;
	date = Params.Date;
	capacity = DF.Pick ( package, "Capacity", 1 );
	price = Goods.Price ( , date, Params.Prices, Params.Item, package, Params.Feature, Params.Organization, Params.Contract, Params.VendorContract, Params.Warehouse, Params.Currency );
	data = new Structure ();
	data.Insert ( "Capacity", capacity );
	data.Insert ( "Price", price );
	data.Insert ( "ProducerPrice", ? ( Params.Social, Goods.ProducerPrice ( Params, date ), 0 ) );
	return data;
	
EndFunction 

&AtClient
Procedure QuantityOnChange ( Item )
	
	Computations.Packages ( ThisObject );
	Computations.Amount ( ThisObject );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );
	updateWarning ();
		
EndProcedure

&AtClient
Procedure PriceOnChange ( Item )

	Computations.Discount ( ThisObject );
	Computations.Amount ( ThisObject );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );

EndProcedure

&AtClient
Procedure AmountOnChange ( Item )
	
	Computations.Price ( ThisObject );
	Computations.Discount ( ThisObject );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );
	
EndProcedure

&AtClient
Procedure PricesOnChange ( Item )
	
	priceItem ();
	Computations.Amount ( ThisObject );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );
	
EndProcedure

&AtClient
Procedure priceItem ()
	
	prices = ? ( Prices.IsEmpty (), Source.Prices, Prices );
	Price = Goods.Price ( , Source.Date, prices, Product, Package, Feature, Organization, Contract, VendorContract, Source.Warehouse, Source.Currency );
	
EndProcedure 

&AtClient
Procedure DiscountRateOnChange ( Item )
	
	Computations.Discount ( ThisObject );
	Computations.Amount ( ThisObject );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );
	
EndProcedure

&AtClient
Procedure DiscountOnChange ( Item )
	
	Computations.DiscountRate ( ThisObject );
	Computations.Amount ( ThisObject );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );
	
EndProcedure

&AtClient
Procedure VATCodeOnChange ( Item )
	
	VATRate = DF.Pick ( VATCode, "Rate" );
	Computations.Total ( ThisObject, VATUse );
	Computations.ExtraCharge ( ThisObject );
	
EndProcedure

&AtClient
Procedure VATOnChange ( Item )
	
	Computations.Total ( ThisObject, VATUse, false );
	Computations.ExtraCharge ( ThisObject );
	
EndProcedure

&AtClient
Procedure ProducerPriceOnChange ( Item )
	
	Computations.ExtraCharge ( ThisObject );
	
EndProcedure
